; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v7 - type_2 ?v2 - type_3)
 	      (pred_3 ?v8 - object ?v2 - type_3)
	      (pred_2 ?v7 - type_2 ?v4 - type_1)
	      (pred_4 ?v7 - type_2 ?v8 - object ?v4 - type_1))

   (:action op_2
       :parameters  (?v7 - type_2 ?v1 ?v5 - type_3)
       :precondition (and  (pred_1 ?v7 ?v1))
       :effect (and  (pred_1 ?v7 ?v5)
		     (not (pred_1 ?v7 ?v1))))

   (:action op_3
       :parameters (?v7 - type_2 ?v3 - object ?v6 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_3 ?v3 ?v6) (pred_1 ?v7 ?v6) (pred_2 ?v7 ?v4))
       :effect (and (pred_4 ?v7 ?v3 ?v4)
		    (not (pred_3 ?v3 ?v6)) 
		    (not (pred_2 ?v7 ?v4))))

   (:action op_1
       :parameters (?v7 - type_2 ?v3 - object ?v6 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_4 ?v7 ?v3 ?v4) (pred_1 ?v7 ?v6))
       :effect (and (pred_3 ?v3 ?v6)
		    (pred_2 ?v7 ?v4)
		    (not (pred_4 ?v7 ?v3 ?v4)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_02 - type_2
obj_10 obj_06 - type_1
obj_09 obj_07 obj_08 obj_01 - type_3
obj_04 obj_03 obj_05 - object)
(:init
(pred_1 obj_02 obj_08)
(pred_2 obj_02 obj_10)
(pred_2 obj_02 obj_06)
(pred_3 obj_04 obj_01)
(pred_3 obj_03 obj_01)
(pred_3 obj_05 obj_09)
)
(:goal
(and
(pred_3 obj_04 obj_09)
(pred_3 obj_03 obj_07)
(pred_3 obj_05 obj_01)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_02 ?b obj_06))))
)
)

; plan
1. (op_2 obj_02 obj_08 obj_09)
   deleted: (pred_1 obj_02 obj_08)
   added: (pred_1 obj_02 obj_09)
   goals met: 0 of 3
2. (op_3 obj_02 obj_05 obj_09 obj_10)
   deleted: (pred_3 obj_05 obj_09) (pred_2 obj_02 obj_10)
   added: (pred_4 obj_02 obj_05 obj_10)
   goals met: 0 of 3
3. (op_2 obj_02 obj_09 obj_01)
   deleted: (pred_1 obj_02 obj_09)
   added: (pred_1 obj_02 obj_01)
   goals met: 0 of 3
4. (op_1 obj_02 obj_05 obj_01 obj_10)
   deleted: (pred_4 obj_02 obj_05 obj_10)
   added: (pred_3 obj_05 obj_01) (pred_2 obj_02 obj_10)
   goals met: 1 of 3
5. (op_3 obj_02 obj_04 obj_01 obj_10)
   deleted: (pred_3 obj_04 obj_01) (pred_2 obj_02 obj_10)
   added: (pred_4 obj_02 obj_04 obj_10)
   goals met: 1 of 3
6. (op_2 obj_02 obj_01 obj_09)
   deleted: (pred_1 obj_02 obj_01)
   added: (pred_1 obj_02 obj_09)
   goals met: 1 of 3
7. (op_1 obj_02 obj_04 obj_09 obj_10)
   deleted: (pred_4 obj_02 obj_04 obj_10)
   added: (pred_3 obj_04 obj_09) (pred_2 obj_02 obj_10)
   goals met: 2 of 3
8. (op_2 obj_02 obj_09 obj_01)
   deleted: (pred_1 obj_02 obj_09)
   added: (pred_1 obj_02 obj_01)
   goals met: 2 of 3
9. (op_3 obj_02 obj_03 obj_01 obj_10)
   deleted: (pred_3 obj_03 obj_01) (pred_2 obj_02 obj_10)
   added: (pred_4 obj_02 obj_03 obj_10)
   goals met: 2 of 3
10. (op_2 obj_02 obj_01 obj_07)
   deleted: (pred_1 obj_02 obj_01)
   added: (pred_1 obj_02 obj_07)
   goals met: 2 of 3
11. (op_1 obj_02 obj_03 obj_07 obj_10)
   deleted: (pred_4 obj_02 obj_03 obj_10)
   added: (pred_3 obj_03 obj_07) (pred_2 obj_02 obj_10)
   goals met: 3 of 3
